/* !Функція повертає масив або інше значення, але не змінює його!
У консоль/html виводите результат виклику функції:
const pairs = getPairs(students);
console.log(pairs);
Перед виконанням цього домашнього завдання необхідно створити 3 масиви:
const students = ["Олександр", "Ігор", "Олена", "Іра", "Олексій", "Світлана"];
const themes = ["Диференційне рівняння", "Теорія автоматів", "Алгоритми і
структури даних"];
const marks = [4, 5, 5, 3, 4, 5]; */
/* 
1.Розділіть студентів на пари(хлопець + дівчина) для работи над проєктом. У вас
повинен вийти вкладений масив з парами студентів: [["Олександр", "Олена"], [..],
[...]];

2.Зіставте пари з попереднього завдання та теми проєктів, над якими студенти
будуть працювати. Повинен вийти вкладений масив виду: [["Олександр і Олена",
"Теорія автоматів"], [...], [...]]

3.Зіставте оцінки(marks) зі студентом(students): [["Саша", 4], [...], [...]]

4.Поставте кожній парі випадкову оцінку(від 1 до 5) за проєкт(тут функція буде
нечистою, але не повинна мутувати массив): [["Олександр і Олена", "Теорія
автоматів", 5], [...], [...]] */

const students = ["Олександр", "Ігор", "Олена", "Іра", "Олексій", "Світлана"];

const themes = [
  "Диференційне рівняння",
  "Теорія автоматів",
  "Алгоритми і структури даних"
];
const marks = [4, 5, 5, 3, 4, 5];

/* 1.Розділіть студентів на пари(хлопець + дівчина) для работи над проєктом. У вас
повинен вийти вкладений масив з парами студентів: [["Олександр", "Олена"], [..],
[...]]; */
const pairs = getPairs(students);
function getPairs(students) {
  let studPairs = [
    [students[0], students[2]],
    [students[1], students[3]],
    [students[4], students[5]],
  ];
  return studPairs;
}
console.log(getPairs(students));

/* 2.Зіставте пари з попереднього завдання та теми проєктів, над якими студенти
будуть працювати. Повинен вийти вкладений масив виду: [["Олександр і Олена",
"Теорія автоматів"], [...], [...]] */

//pairs [[],[],[]], themes['','','']

//pairsThemes[['',''], ['',''], ['','']]


